#+STARTUP: overview

* New memory map

Assuming PAGE=&1100 and HIMEM=&5800 there are 71 pages of main RAM.

Generous estimates for budgets: (current totals are lower)

| What           | # pages |
|----------------+---------|
| Level data     |      10 |
| GMC            |      16 |
| GBAS           |      35 |
| GBAS variables |       2 |
| BASIC stack    |       1 |
|----------------+---------|
| Total          |      64 |
#+TBLFM: @>$2=vsum(@I..@II)
(do a C-c C-c on the TBLFM line to update the total)

Additional free RAM could be found at $900 and $a00. And the BASIC
input buffer at $700 could be available for emergency use.

This suggests as a first draft memory map:

| Page | What            | Notes                               |
|------+-----------------+-------------------------------------|
|   09 | Object arrays   |                                     |
|   0a |                 |                                     |
|------+-----------------+-------------------------------------|
|   0b | ...             |                                     |
|------+-----------------+-------------------------------------|
|   0c | UDGs (OS 1.20)  |                                     |
|------+-----------------+-------------------------------------|
|   11 | GBAS            | PAGE=&1100                          |
|   12 |                 |                                     |
|   13 |                 |                                     |
|   14 |                 |                                     |
|   15 |                 |                                     |
|   16 |                 |                                     |
|   17 |                 |                                     |
|   18 |                 |                                     |
|   19 |                 |                                     |
|   1a |                 |                                     |
|   1b |                 |                                     |
|   1c |                 |                                     |
|   1d |                 |                                     |
|   1e |                 |                                     |
|   1f |                 |                                     |
|   20 |                 |                                     |
|   21 |                 |                                     |
|   22 |                 |                                     |
|   23 |                 |                                     |
|   24 |                 |                                     |
|   25 |                 |                                     |
|   26 |                 |                                     |
|   27 |                 |                                     |
|   28 |                 |                                     |
|   29 |                 |                                     |
|   2a |                 |                                     |
|   2b |                 |                                     |
|   2c |                 |                                     |
|   2d |                 |                                     |
|   2e |                 |                                     |
|   2f |                 |                                     |
|   30 |                 |                                     |
|   31 |                 |                                     |
|   32 |                 |                                     |
|   33 |                 | TOP=approx &3400                    |
|------+-----------------+-------------------------------------|
|   34 | BASIC variables | currently don't even reach $3600... |
|   35 |                 |                                     |
|   36 |                 |                                     |
|   37 |                 |                                     |
|   38 |                 |                                     |
|   39 |                 |                                     |
|   3a | BASIC stack     | HIMEM=&3B00                         |
|------+-----------------+-------------------------------------|
|   3b | GMC             |                                     |
|   3c |                 |                                     |
|   3d |                 |                                     |
|   3e |                 |                                     |
|   3f |                 |                                     |
|   40 |                 |                                     |
|   41 |                 |                                     |
|   42 |                 |                                     |
|   43 |                 |                                     |
|   44 |                 |                                     |
|   45 |                 |                                     |
|   46 |                 |                                     |
|   47 |                 |                                     |
|   48 |                 |                                     |
|   49 |                 |                                     |
|   4a |                 |                                     |
|   4b |                 |                                     |
|   4c |                 |                                     |
|------+-----------------+-------------------------------------|
|   4d | Levels          |                                     |
|   4e |                 |                                     |
|   4f |                 |                                     |
|   50 |                 |                                     |
|   51 |                 |                                     |
|   52 |                 |                                     |
|   53 |                 |                                     |
|   54 |                 |                                     |
|   55 |                 |                                     |
|   56 |                 |                                     |
|   57 |                 |                                     |
|------+-----------------+-------------------------------------|
|   58 | Screen          |                                     |
|  ... |                 |                                     |
|   7f |                 |                                     |
|------+-----------------+-------------------------------------|

GBAS changes mode somewhat often, but this is fixable - set HIMEM on
startup and use VDU22 to switch mode after.

(Another option might be just to let BASIC do its normal thing, and
put stuff somewhere in the spare area between top of vars and bottom
of stack. But then BASIC can't check for running out of space, which
is a big advantage of changing HIMEM.)

